[
  {
    "title": "How To Wear Chocolate Brown",
    "description": "Products are independently selected by our editors. We may earn an affiliate commission from links.",
    "content": "It actually shouldn’t be surprising that I love chocolate brown as a color considering I am a lover of all things chocolate in snack form. But there is something that I just love about chocolate brown on my body — clothes, shoes, accessories…ALL OF IT. (Am I dramatic?). I have so many chocolate brown outfit ideas thanks to these pieces!",
    "coverImg": "https://substackcdn.com/image/fetch/w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc5873f69-1bb2-4056-94fa-a4b100d0e428_800x1200.png",
    "category": "aesthetic : dark academia",
    "author": {
      "_id": "6768366b4686497840da6097",
      "email": "user5@gmail.com"
    },
    "rating": 4,
    "createdAt": "2024-12-22T16:31:12.437Z"
  },
  {
    "title": "Shop Street Style’s Most Covetable Fall and Winter Jackets",
    "description": "Products are independently selected by our editors. We may earn an affiliate commission from links.",
    "content": "It’s finally cold enough to pull out our frosty weather essentials. The change in temperature inspired a look-back through our street style archive to identify the best jackets and coats. On our radar are leather trenches—a favorite of Lisa from Blackpink—as well as some eye-catching printed wonders, like Dries Van Noten’s watercolor-inspired silk number. Scroll through to discover and shop the latest cold weather trends.",
    "coverImg": "https://assets.vogue.com/photos/65d7d3f3cb7d92a8662a2a9a/master/w_2560%2Cc_limit/MILAN-STREETSTYLE-PHILOH-DAY2-%252026.jpg",
    "category": "seasonal - winter",
    "author": {
      "_id": "6748442855826638751a8fbf",
      "email": "john@example.com"
    },
    "rating": 4,
    "createdAt": "2024-12-19T13:24:41.439Z"
  },
  {
    "title": "The Best Street Style From Paris Fashion Week Spring 2022",
    "description": "Products are independently selected by our editors. We may earn an affiliate commission from links.",
    "content": "Paris Fashion Week is the final stop on the fashion month circuit, and the street style scene is always a grand finale. This season, showgoers brought their A-game, wearing everything from bold prints to statement accessories. Vogue’s Phil Oh was on the ground capturing the best looks, from the chicest show attendees to the models off duty. Scroll through to see the best street style from Paris Fashion Week Spring 2022.",
    "coverImg": "https://assets.vogue.com/photos/65d7d3f3cb7d92a8662a2a9a/master/w_2560%2Cc_limit/MILAN-STREETSTYLE-PHILOH-DAY2-%252026.jpg",
    "category": "seasonal - spring",
    "author": {
      "_id": "6748442855826638751a8fbf",
      "email": "user2@gmail.com"
    },
    "rating": 4,
    "createdAt": "2024-12-19T13:24:41.439Z"
  },
  {
    "title": "Olivia Rodrigo's 'Guts' Era: Fashion Inspo for a New Season",
    "description": "Olivia’s ‘Guts’ era is not just about music—it’s about fashion. Check out the bold outfits that define her latest album.",
    "content": "From oversized jackets to bold prints, Olivia’s ‘Guts’ era is full of daring fashion moments that reflect the album’s edgy vibe. Whether you’re into oversized blazers or chunky boots, these pieces will elevate your wardrobe to new heights.",
    "coverImg": "https://example.com/olivia-guts-era.jpg",
    "category": "fashion - album fashion",
    "author": {
      "_id": "6748442855826638762a8fbf",
      "email": "victoria@example.com"
    },
    "rating": 5,
    "createdAt": "2024-12-21T15:30:40.439Z"
  },
  {
    "title": "Harry Styles’ Love on Tour Fashion: The Best Outfits to Steal",
    "description": "Harry Styles’ Love on Tour was filled with fashion moments. Let’s look at his bold, colorful tour outfits that stole the show.",
    "content": "Harry’s Love on Tour outfits were all about mixing vibrant colors, patterns, and textures. From rainbow suits to statement accessories, he made every outfit count. Find out how to steal his tour looks for your next night out!",
    "coverImg": "https://example.com/harry-loveontour.jpg",
    "category": "fashion - concert style",
    "author": {
      "_id": "6748442855826638763a8fbf",
      "email": "emma@example.com"
    },
    "rating": 5,
    "createdAt": "2024-12-22T11:40:55.439Z"
  },
  {
    "title": "Taylor Swift’s Fearless Fashion: Recreating Her Most Iconic Looks",
    "description": "Taylor Swift’s Fearless era was full of iconic fashion moments. Let’s revisit her best outfits from this unforgettable period.",
    "content": "From country-inspired dresses to her glittering stage outfits, Taylor’s Fearless era is filled with unforgettable fashion moments. Let’s take a trip down memory lane and explore how to recreate her looks from this era.",
    "coverImg": "https://example.com/taylor-fearless-fashion.jpg",
    "category": "fashion - retro",
    "author": {
      "_id": "6748442855826638761a8fbf",
      "email": "grace@example.com"
    },
    "rating": 4,
    "createdAt": "2024-12-19T16:50:20.439Z"
  },
  {
    "title": "Sabrina Carpenter's Latest Album Promo Looks Are All About Fashion",
    "description": "From casual streetwear to glitzy red carpet dresses, Sabrina Carpenter is bringing her A-game with every album release. Here’s a breakdown of her best promo looks.",
    "content": "Sabrina has been serving major style moments while promoting her latest album. Whether it’s a sleek jumpsuit or an oversized blazer, she’s taking over both the stage and the streets. Get the details on her latest outfits and how to recreate them for your own style.",
    "coverImg": "https://example.com/sabrina-promo-look.jpg",
    "category": "fashion - album promo",
    "author": {
      "_id": "6748442855826638760a8fbf",
      "email": "tessa@example.com"
    },
    "rating": 5,
    "createdAt": "2024-12-18T14:25:50.439Z"
  },
  {
    "title": "The Best Coachella Outfits That Had Us Talking",
    "description": "Coachella is the ultimate festival for fashion lovers. Here are the outfits that had everyone talking this year.",
    "content": "Festival season is all about bold and unique fashion. From boho chic to edgy streetwear, Coachella attendees know how to slay. Discover the best festival outfits that took center stage at this year’s Coachella.",
    "coverImg": "https://example.com/coachella2024.jpg",
    "category": "fashion - festival",
    "author": {
      "_id": "6748442855826638754a8fbf",
      "email": "claire@example.com"
    },
    "rating": 4,
    "createdAt": "2024-12-22T11:55:30.439Z"
  },
  {
    "title": "The Best Fashion Moments From the Met Gala 2024",
    "description": "The Met Gala is the ultimate fashion event of the year. Here’s a roundup of the best looks from the 2024 event.",
    "content": "The 2024 Met Gala did not disappoint! From couture gowns to avant-garde outfits, the stars brought their A-game. Here are the top fashion moments that stole the spotlight at this year’s gala.",
    "coverImg": "https://example.com/metgala2024.jpg",
    "category": "fashion - red carpet",
    "author": {
      "_id": "6748442855826638751a8fbf",
      "email": "taylor@example.com"
    },
    "rating": 5,
    "createdAt": "2024-12-20T16:10:40.439Z"
  },
  {
    "title": "How to Master the TikTok Fashion Trend Everyone is Talking About",
    "description": "TikTok is ruling the fashion world, and the latest viral trends are taking over. Here’s how you can jump on the next big thing.",
    "content": "From viral fashion hacks to trendy outfits, TikTok is the ultimate fashion inspiration. Whether it’s the cottagecore aesthetic or edgy street style, we’re breaking down how to get your look noticed on the app.",
    "coverImg": "https://example.com/tiktok-fashion.jpg",
    "category": "fashion - social media",
    "author": {
      "_id": "6748442855826638753a8fbf",
      "email": "alyssa@example.com"
    },
    "rating": 3,
    "createdAt": "2024-12-16T13:25:45.439Z"
  },
  {
    "title": "Why Y2K Fashion is Back and Better Than Ever",
    "description": "Y2K fashion is making a major comeback, and we’re here for it. From low-rise jeans to bedazzled accessories, we’re bringing the ‘00s back.",
    "content": "The ‘00s are calling, and they want their fashion trends back! Y2K style is everywhere, from pop star-inspired outfits to sparkly details. Here’s how to incorporate this nostalgic trend into your everyday wardrobe.",
    "coverImg": "https://example.com/y2k-fashion.jpg",
    "category": "fashion - retro",
    "author": {
      "_id": "6748442855826638751a8fbf",
      "email": "lucas@example.com"
    },
    "rating": 4,
    "createdAt": "2024-12-12T09:40:55.439Z"
  },
  {
    "title": "Zendaya’s Red Carpet Looks That Are Pure Fire",
    "description": "Zendaya never misses a fashion moment. Here’s a breakdown of her best red carpet outfits that are nothing short of iconic.",
    "content": "From daring Versace gowns to chic two-piece sets, Zendaya has redefined what it means to turn heads on the red carpet. Explore some of her most memorable fashion moments and discover how you can recreate them.",
    "coverImg": "https://example.com/zendaya-redcarpet.jpg",
    "category": "fashion - celebrity style",
    "author": {
      "_id": "6748442855826638753a8fbf",
      "email": "julia@example.com"
    },
    "rating": 4,
    "createdAt": "2024-12-07T12:30:10.439Z"
  },
  {
    "title": "The Ultimate Guide to Fall Footwear",
    "description": "From boots to sneakers, fall is the perfect time to update your footwear collection. Here's everything you need to know about fall footwear trends.",
    "content": "Autumn brings the perfect opportunity to change up your footwear. Whether you're looking for stylish ankle boots or comfy sneakers, we’ve rounded up the best fall footwear that will take you from work to weekend.",
    "coverImg": "https://example.com/fallfootwear.jpg",
    "category": "seasonal - fall",
    "author": {
      "_id": "6748442855826638752a8fbf",
      "email": "michael@example.com"
    },
    "rating": 4,
    "createdAt": "2024-12-19T08:00:55.439Z"
  }
]
